perf/concurrent_users.yaml
config:
  ensure:
    maxErrorRate: 0.1

  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"
    node_replicated:
      target: 'http://localhost:5555/node_replicated'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node_replicated"


  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ph3   
      duration: 10   
      arrivalRate: 3
    - pause: 20
    - name: Ph4   
      duration: 10   
      arrivalRate: 4
    - pause: 20
    - name: Ph5   
      duration: 10   
      arrivalRate: 5
    - pause: 20
    - name: Ph6   
      duration: 10   
      arrivalRate: 6
    - pause: 20
    - name: Ph7   
      duration: 10   
      arrivalRate: 7
    - pause: 20
    - name: Ph8   
      duration: 10   
      arrivalRate: 8
    - pause: 20
    - name: Ph9   
      duration: 10   
      arrivalRate: 9
    - pause: 445
    - name: Ph10   
      duration: 10   
      arrivalRate: 10
    - pause: 495
    - name: Ph11   
      duration: 10   
      arrivalRate: 11
    - pause: 545
    - name: Ph12   
      duration: 10   
      arrivalRate: 12
    - pause: 595
    - name: Ph13   
      duration: 10   
      arrivalRate: 13
    - pause: 645
    - name: Ph14   
      duration: 10   
      arrivalRate: 14
    - pause: 695
    - name: Ph15   
      duration: 10   
      arrivalRate: 15
    - pause: 745
    - name: Ph16   
      duration: 10   
      arrivalRate: 16
    - pause: 795
    - name: Ph18   
      duration: 10   
      arrivalRate: 18
    - pause: 895
    - name: Ph20   
      duration: 10   
      arrivalRate: 20
    - pause: 995
    - name: Ph22   
      duration: 10   
      arrivalRate: 22
    - pause: 1095
    - name: Ph24   
      duration: 10   
      arrivalRate: 24
    - pause: 1195
    - name: Ph26   
      duration: 10   
      arrivalRate: 26
    - pause: 1295
    - name: Ph28   
      duration: 10   
      arrivalRate: 28
    - pause: 1395
    - name: Ph30   
      duration: 10   
      arrivalRate: 30
    - pause: 1495

scenarios:
  - name: Timeout
    flow:
      - get:
          url: '/timeout'